2865876579/espmerged/sdkconfig.defaults
# ===== Chip / Flash / PSRAM =====
CONFIG_IDF_TARGET="esp32s3"

# N16R8: 16MB Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# N16R8: 8MB PSRAM (Octal SPI), needed for audio buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ===== Partition table: custom with model partition =====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== Main task stack =====
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# ===== Timer task stack: larger stack for timer callbacks =====
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# ===== Serial monitor: application events are printed explicitly =====
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y

# ===== ESP-SR: WakeNet9 NIHAOXIAOAN_TTS2 =====
CONFIG_SR_WN_WN9_NIHAOXIAOAN_TTS2=y

# MultiNet7: offline playback stop commands.
CONFIG_SR_MN_CN_MULTINET7_QUANT=y

# ===== ESP-SR / ESP-DL performance baseline =====
# Match Espressif's ESP32-S3 MultiNet7 example. Running the model at 160 MHz
# with half-size caches caused watchdog/FFT failures during local stop detection.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
